PROXY_TYPE_EMOJI = {
    'HTTP': '🌐',
    'HTTPS': '🔒',
    'SOCKS4': '🧦',
    'SOCKS5': '🧦'
}


PROXY_VERSION_MAP = {
    4: 'IPv4',
    3: 'IPv4 Shared',
    6: 'IPv6',
    '4': 'IPv4',
    '3': 'IPv4 Shared',
    '6': 'IPv6'
}

PROXY_TYPE_MAP = {
    'http': 'HTTPS',
    'socks': 'SOCKS5'
}


COUNTRY_NAMES = {
    'ru': 'Россия',       'jp': 'Япония',        'gb': 'Великобритания', 'th': 'Таиланд',
    'br': 'Бразилия',     'ca': 'Канада',        'my': 'Малайзия',      'au': 'Австралия',
    'pl': 'Польша',       'us': 'США',           'eg': 'Египет',        'ie': 'Ирландия',
    'ua': 'Украина',      'id': 'Индонезия',     'in': 'Индия',         'cz': 'Чехия',
    'gr': 'Греция',       'nl': 'Нидерланды',    'pt': 'Португалия',    'lt': 'Литва',
    'ch': 'Швейцария',    'dk': 'Дания',         'de': 'Германия',      'lv': 'Латвия',
    'kr': 'Южная Корея',  'at': 'Австрия',       'za': 'ЮАР',           'ng': 'Нигерия',
    'cl': 'Чили',         'bg': 'Болгария',      'it': 'Италия',        'no': 'Норвегия',
    'ro': 'Румыния',      'ph': 'Филиппины',     'tm': 'Туркменистан',  'il': 'Израиль',
    'fi': 'Финляндия',    'ma': 'Марокко',       'sg': 'Сингапур',      'be': 'Бельгия',
    'ae': 'ОАЭ',          'si': 'Словения',      'kg': 'Кыргызстан',    'rs': 'Сербия',
    'es': 'Испания',      'kz': 'Казахстан',     'tw': 'Тайвань',       'md': 'Молдова',
    'by': 'Беларусь',     'fr': 'Франция',       'sa': 'Саудовская Аравия', 'tr': 'Турция',
    'bd': 'Бангладеш',    'vn': 'Вьетнам',       'uz': 'Узбекистан',    'am': 'Армения',
    'cy': 'Кипр',         'mx': 'Мексика',       'ee': 'Эстония',       'tj': 'Таджикистан',
    'se': 'Швеция',       'hk': 'Гонконг',       'ge': 'Грузия',        'cn': 'Китай'
}


COUNTRY_FLAGS = {
            'ru': '🇷🇺', 'jp': '🇯🇵', 'gb': '🇬🇧', 'th': '🇹🇭', 'br': '🇧🇷',
            'ca': '🇨🇦', 'my': '🇲🇾', 'au': '🇦🇺', 'pl': '🇵🇱', 'us': '🇺🇸',
            'eg': '🇪🇬', 'ie': '🇮🇪', 'ua': '🇺🇦', 'id': '🇮🇩', 'in': '🇮🇳',
            'cz': '🇨🇿', 'gr': '🇬🇷', 'nl': '🇳🇱', 'pt': '🇵🇹', 'lt': '🇱🇹',
            'ch': '🇨🇭', 'dk': '🇩🇰', 'de': '🇩🇪', 'lv': '🇱🇻', 'kr': '🇰🇷',
            'at': '🇦🇹', 'za': '🇿🇦', 'ng': '🇳🇬', 'cl': '🇨🇱', 'bg': '🇧🇬',
            'it': '🇮🇹', 'no': '🇳🇴', 'ro': '🇷🇴', 'ph': '🇵🇭', 'tm': '🇹🇲',
            'il': '🇮🇱', 'fi': '🇫🇮', 'ma': '🇲🇦', 'sg': '🇸🇬', 'be': '🇧🇪',
            'ae': '🇦🇪', 'si': '🇸🇮', 'kg': '🇰🇬', 'rs': '🇷🇸', 'es': '🇪🇸',
            'kz': '🇰🇿', 'tw': '🇹🇼', 'md': '🇲🇩', 'by': '🇧🇾', 'fr': '🇫🇷',
            'sa': '🇸🇦', 'tr': '🇹🇷', 'bd': '🇧🇩', 'vn': '🇻🇳', 'uz': '🇺🇿',
            'am': '🇦🇲', 'cy': '🇨🇾', 'mx': '🇲🇽', 'ee': '🇪🇪', 'tj': '🇹🇯',
            'se': '🇸🇪', 'hk': '🇭🇰', 'ge': '🇬🇪', 'cn': '🇨🇳'
        }